# Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса.
# Атрибуты сделать защищенными.
# Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длина*ширина*масса асфальта для покрытия одного кв метра дороги асфальтом,
# толщиной в 1 см*число см толщины полотна. Проверить работу метода.
# Например: 20м*5000м*25кг*5см = 12500 т


class Road:

    def __init__(self, _lenght, _width):
        self._lenght = _lenght
        self._width = _width

    def calculation(self):
        result = self._lenght * self._width * 25 * 5
        return result


my_road = Road(20, 5000)
print(f"Вес асфальта равен {my_road.calculation()/1000}")
